/*==============================================================================

   2D描画用頂点シェーダー [shader_vertex_2d.hlsl]
														 Author : Youhei Sato
														 Date   : 2025/05/15
--------------------------------------------------------------------------------

==============================================================================*/

// 定数バッファ
float4x4 mtx;

struct VS_OUT
{
	float4 posH : SV_POSITION;
	float4 color : COLOR0;
};

//=============================================================================
// 頂点シェーダ
//=============================================================================
VS_OUT main(in float4 posL : POSITION0, in float4 color : COLOR0)
{
	VS_OUT vo;

	vo.posH = mul(posL, mtx);
	vo.color = color;

	return vo;
}
